УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрироватьЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоступлениеОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиДляПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Груз</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПервогоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаВозвратнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаПредоплатыДоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаАвансаДоПодтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПроводитьДокументПриВысокомСПАРКРиске</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартОтветственныйЗаСПАРКРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартПредзаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="690a0f93-be8f-4a32-8881-57f1d122fbb8">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/смартПредзаказыПоставщикам/смартПредзаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>смартПредзаказыПоставщикам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>ПредзаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказПоставщику/Forms/смартФормаЗаполненияПоПредзаказам/Module.bsl
#Область СобытияФормыИЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Партнер=Параметры.Партнер;
	ОбновитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Развернуть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Партнер) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен 'Партнер'",,"Партнет");
		Возврат;
	КонецЕсли;	
	ОбновитьТаблицуНаСервере();
	Развернуть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоПредзаказамВыбратьПриИзменении(Элемент)
	Стр=Элементы.ОстаткиПоПредзаказам.ТекущиеДанные;
	Если Стр.Выбрано>Стр.ВсегоДоступно Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Доступно для выбора: "+Стр.ВсегоДоступно,,"ОстаткиПоПредзаказам["+Формат(Стр.ПолучитьИдентификатор(),"ЧГ=")+"]."+Элемент.Имя,);
		Возврат;
	КонецЕсли;	
	//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	//Стр.Выб=Истина;
	Стр.Выб = Стр.Выбрано > 0;
	//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Свернуть(Команда)
	Для Каждого Стр Из ОстаткиПоПредзаказам.ПолучитьЭлементы() Цикл 
		Элементы.ОстаткиПоПредзаказам.Свернуть(Стр.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	Для Каждого Стр Из ОстаткиПоПредзаказам.ПолучитьЭлементы() Цикл 
		Элементы.ОстаткиПоПредзаказам.Развернуть(Стр.ПолучитьИдентификатор(),Истина);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВЗаказ(Команда)
	Закрыть(Новый Структура("Партнер,Товары",Партнер,ПолучитьДанныеДляПереносаВЗаказ()));
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВЗаказВыделенныеСтроки(Команда)
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	Закрыть(Новый Структура("Партнер,Товары",Партнер,ПолучитьДанныеДляПереносаВЗаказВыделенныеСтроки()));
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВЗаказПредзаказы(Команда)
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	Закрыть(Новый Структура("Партнер,Товары",Партнер,ПолучитьДанныеДляПереносаВЗаказПредзаказы()));
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаКлиенте
Процедура СвернутьКопия(Команда)
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	Для Каждого Стр Из ОстаткиПоПредзаказамКопия.ПолучитьЭлементы() Цикл 
		Элементы.ОстаткиПоПредзаказамКопия.Свернуть(Стр.ПолучитьИдентификатор());
	КонецЦикла;
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьКопия(Команда)
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	Для Каждого Стр Из ОстаткиПоПредзаказамКопия.ПолучитьЭлементы() Цикл 
		Элементы.ОстаткиПоПредзаказамКопия.Развернуть(Стр.ПолучитьИдентификатор(),Истина);
	КонецЦикла;	
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОбновитьТаблицуНаСервере()	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Партнер",Партнер);
	Запрос.Текст="ВЫБРАТЬ
	             |	смартПредзаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	             |	смартПредзаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	             |	смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику КАК ПредзаказПоставщику,
				 //++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	             |	ПРЕДСТАВЛЕНИЕ(смартПредзаказыПоставщикамОстатки.Номенклатура) КАК ПредставлениеНоменклатура,
	             |	смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику.Менеджер КАК МенеджерПредзаказ,
	             |	ИСТИНА КАК ПризнакСтроки,
				 //--#1227 смарт: Лопато 31.10.2022
	             |	смартПредзаказПоставщикуТовары.Цена КАК Цена,
	             |	смартПредзаказПоставщикуТовары.ВидЦеныПоставщика КАК ВидЦеныПоставщика,
	             |	смартПредзаказПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
	             |	смартПредзаказПоставщикуТовары.КоличествоУпаковок КАК ВсегоВПредзаказе,
	             |	смартПредзаказПоставщикуТовары.КоличествоУпаковок - смартПредзаказыПоставщикамОстатки.ЗаказаноОстаток КАК ВсегоВыкуплено,
	             |	смартПредзаказыПоставщикамОстатки.ЗаказаноОстаток КАК ВсегоДоступно,
	             |	ЛОЖЬ КАК Выб,
	             |	0 КАК Выбрано
	             |ИЗ
	             |	РегистрНакопления.смартПредзаказыПоставщикам.Остатки(, Партнер = &Партнер) КАК смартПредзаказыПоставщикамОстатки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартПредзаказПоставщику.Товары КАК смартПредзаказПоставщикуТовары
	             |		ПО смартПредзаказыПоставщикамОстатки.Партнер = смартПредзаказПоставщикуТовары.Ссылка.Партнер
	             |			И смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику = смартПредзаказПоставщикуТовары.Ссылка.Ссылка
	             |			И смартПредзаказыПоставщикамОстатки.Номенклатура = смартПредзаказПоставщикуТовары.Номенклатура
	             |			И смартПредзаказыПоставщикамОстатки.Характеристика = смартПредзаказПоставщикуТовары.Характеристика
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику.Дата
	             |ИТОГИ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПредзаказПоставщику),
	             |	СУММА(ВсегоВПредзаказе),
	             |	СУММА(ВсегоВыкуплено),
	             |	СУММА(ВсегоДоступно)
	             |ПО
	             |	Номенклатура";
				 
	//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам           
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗначениеВРеквизитФормы(РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам), "ОстаткиПоПредзаказам");
	
	Элементы.МенеджерПредзаказ.СписокВыбора.Очистить();
	ТаблицаМенеджеров = РезультатЗапроса.Выгрузить();
	ТаблицаМенеджеров.Свернуть("МенеджерПредзаказ");
	Элементы.МенеджерПредзаказ.СписокВыбора.ЗагрузитьЗначения(ТаблицаМенеджеров.ВыгрузитьКолонку("МенеджерПредзаказ"));
	Элементы.МенеджерПредзаказ.СписокВыбора.СортироватьПоПредставлению();
	
	Если Элементы.МенеджерПредзаказ.СписокВыбора.Количество() > 0 И Элементы.МенеджерПредзаказ.СписокВыбора[0].Представление = "" Тогда
		Элементы.МенеджерПредзаказ.СписокВыбора.Удалить(0);
	КонецЕсли;	
	//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры	

&НаСервере
Функция ПолучитьДанныеДляПереносаВЗаказ()
	//++#1227 смарт: Лопато 07.11.2022 //Групповое заполнение Заказа поставщику по предзаказам
	Если Элементы.ПрименитьОтбор.Заголовок = "Отменить отбор" Тогда
		ОтменитьОтбор();
	КонецЕсли;	
	//--#1227 смарт: Лопато 31.10.2022
	тДерево = РеквизитФормыВЗначение("ОстаткиПоПредзаказам");
	МассивСтрок=тДерево.Строки.НайтиСтроки(Новый Структура("Выб",Истина),Истина);
	МассивВыбора=Новый Массив;
	Для Каждого Стр Из МассивСтрок Цикл 
		МассивВыбора.Добавить(Новый Структура("Номенклатура,Характеристика,КоличествоУпаковок,Цена,ВидЦеныПоставщика,СтавкаНДС,смартПредзаказПоставщику",
		Стр.Номенклатура,
		Стр.Характеристика,
		Стр.Выбрано,
		Стр.Цена,
		Стр.ВидЦеныПоставщика,
		Стр.СтавкаНДС,
		Стр.ПредзаказПоставщику));
	КонецЦикла;
	Возврат МассивВыбора;
КонецФункции	

&НаКлиенте
Процедура ОстаткиПоПредзаказамПредзаказПоставщикуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоПредзаказамПредзаказПоставщикуНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПереносаВЗаказВыделенныеСтроки()
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам

	МассивВыбора = Новый Массив;

	Если Элементы.ОстаткиПоПредзаказам.Видимость Тогда
		МассивСтрок = Элементы.ОстаткиПоПредзаказам.ВыделенныеСтроки;
	ИначеЕсли Элементы.ОстаткиПоПредзаказамКопия.Видимость Тогда
		МассивСтрок = Элементы.ОстаткиПоПредзаказамКопия.ВыделенныеСтроки;
	Иначе
		Возврат МассивВыбора;
	КонецЕсли;	
	
	Для Каждого ИдентификаторСтроки Из МассивСтрок Цикл 
		
		Если Элементы.ОстаткиПоПредзаказам.Видимость Тогда
	 		Стр = ОстаткиПоПредзаказам.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИначеЕсли Элементы.ОстаткиПоПредзаказамКопия.Видимость Тогда
	 		Стр = ОстаткиПоПредзаказамКопия.НайтиПоИдентификатору(ИдентификаторСтроки);
		КонецЕсли;	
		
		МассивВыбора.Добавить(Новый Структура("Номенклатура,Характеристика,КоличествоУпаковок,Цена,ВидЦеныПоставщика,СтавкаНДС,смартПредзаказПоставщику",
		Стр.Номенклатура,
		Стр.Характеристика,
		Стр.ВсегоДоступно,
		Стр.Цена,
		Стр.ВидЦеныПоставщика,
		Стр.СтавкаНДС,
		Стр.ПредзаказПоставщику));
		
	КонецЦикла;
	
	Возврат МассивВыбора;
	
//--#1227 смарт: Лопато 31.10.2022
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляПереносаВЗаказПредзаказы()
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам

	МассивВыбора = Новый Массив;

	Если Элементы.ОстаткиПоПредзаказам.Видимость Тогда
		МассивСтрок = Элементы.ОстаткиПоПредзаказам.ВыделенныеСтроки;
	ИначеЕсли Элементы.ОстаткиПоПредзаказамКопия.Видимость Тогда
		МассивСтрок = Элементы.ОстаткиПоПредзаказамКопия.ВыделенныеСтроки;
	Иначе
		Возврат МассивВыбора;
	КонецЕсли;	
	
	МассивПредзаказов = Новый Массив;

	Для Каждого ИдентификаторСтроки Из МассивСтрок Цикл 
		
		Если Элементы.ОстаткиПоПредзаказам.Видимость Тогда
			Стр = ОстаткиПоПредзаказам.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИначеЕсли Элементы.ОстаткиПоПредзаказамКопия.Видимость Тогда
			Стр = ОстаткиПоПредзаказамКопия.НайтиПоИдентификатору(ИдентификаторСтроки);
		Иначе
			Прервать;
		КонецЕсли;	
		
		Если МассивПредзаказов.Найти(Стр.ПредзаказПоставщику) = Неопределено Тогда
			МассивПредзаказов.Добавить(Стр.ПредзаказПоставщику);
		КонецЕсли;
		
	КонецЦикла;	
		
	Если Элементы.ОстаткиПоПредзаказам.Видимость Тогда
		тДерево = РеквизитФормыВЗначение("ОстаткиПоПредзаказам");
	ИначеЕсли Элементы.ОстаткиПоПредзаказамКопия.Видимость Тогда
		тДерево = РеквизитФормыВЗначение("ОстаткиПоПредзаказамКопия");
	Иначе
		Возврат МассивВыбора;
	КонецЕсли;	

	Для каждого ЭлементПредзаказ Из МассивПредзаказов Цикл
		
		ОтборПредзаказ = Новый Структура("ПредзаказПоставщику", ЭлементПредзаказ);
		
		НайденныеСтроки = тДерево.Строки.НайтиСтроки(ОтборПредзаказ, Истина);	
		
		Для Каждого Стр Из НайденныеСтроки Цикл
			
			МассивВыбора.Добавить(Новый Структура("Номенклатура,Характеристика,КоличествоУпаковок,Цена,ВидЦеныПоставщика,СтавкаНДС,смартПредзаказПоставщику",
			Стр.Номенклатура,
			Стр.Характеристика,
			Стр.ВсегоДоступно,
			Стр.Цена,
			Стр.ВидЦеныПоставщика,
			Стр.СтавкаНДС,
			Стр.ПредзаказПоставщику));
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивВыбора;
	
//--#1227 смарт: Лопато 31.10.2022
КонецФункции

&НаКлиенте
Процедура УстановитьОтбор(Команда)
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	
	Если Элементы.ПрименитьОтбор.Заголовок = "Применить отбор" Тогда
		ПрименитьОтбор();
	Иначе
		ОтменитьОтбор();
	КонецЕсли;	
	
	УстановитьВидимостьОтбора();
	
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаСервере
Процедура ПрименитьОтбор()
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	
	ДеревоИсточник = РеквизитФормыВЗначение("ОстаткиПоПредзаказам");
	ДеревоКопия = ДеревоИсточник.Скопировать();
	
	КолонкиКопия = ДеревоКопия.Колонки;
	КолонкиКопия.Добавить("Индекс");
	КолонкиКопия.Добавить("ИндексРодитель");
	
	СтрокиНоменклатураКУдалению = Новый Массив;
	
	СтрокиНоменклатура = ДеревоКопия.Строки;

	Для Каждого ТекСтрНоменклатура Из СтрокиНоменклатура Цикл
		
		ТекСтрНоменклатура.Индекс = СтрокиНоменклатура.Индекс(ТекСтрНоменклатура);
		
		СтрокиЗаказ = ТекСтрНоменклатура.Строки;
		Для Каждого ТекСтрЗаказ Из СтрокиЗаказ Цикл
            ТекСтрЗаказ.Индекс = СтрокиЗаказ.Индекс(ТекСтрЗаказ);
			ТекСтрЗаказ.ИндексРодитель = ТекСтрНоменклатура.Индекс; 
		КонецЦикла;	
		
		НоменклатураСоответствуетОтбору = Истина;
		
		Если ЗначениеЗаполнено(СтрокаПоискаНоменклатура) Тогда
			
			НоменклатураНаименование = СокрЛП(НРег(ТекСтрНоменклатура.ПредставлениеНоменклатура));

			Если СтрНайти(НоменклатураНаименование, СокрЛП(НРег(СтрокаПоискаНоменклатура))) = 0 Тогда

				НоменклатураСоответствуетОтбору = Ложь;
				СтрокиНоменклатураКУдалению.Добавить(ТекСтрНоменклатура.Индекс);
				
			КонецЕсли;
			
		КонецЕсли;	
				
		Если НоменклатураСоответствуетОтбору И ЗначениеЗаполнено(МенеджерПредзаказ) Тогда
			
			СтрокиЗаказКУдалению = Новый Массив;
			
			СтрокиЗаказ = ТекСтрНоменклатура.Строки;
			Для Каждого ТекСтрЗаказ Из СтрокиЗаказ Цикл
				Если ТекСтрЗаказ.МенеджерПредзаказ <> МенеджерПредзаказ Тогда
					СтрокиЗаказКУдалению.Добавить(СтрокиЗаказ.Индекс(ТекСтрЗаказ));
				КонецЕсли;	                                                 
			КонецЦикла;	

			ТекущийИндекс = СтрокиЗаказКУдалению.ВГраница();
			Пока ТекущийИндекс >= 0 Цикл
				СтрокиЗаказ.Удалить(СтрокиЗаказКУдалению[ТекущийИндекс]);
				ТекущийИндекс = ТекущийИндекс - 1;
			КонецЦикла;

			Если СтрокиЗаказ.Количество() = 0 Тогда
				СтрокиНоменклатураКУдалению.Добавить(ТекСтрНоменклатура.Индекс);
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ТекущийИндекс = СтрокиНоменклатураКУдалению.ВГраница();
	Пока ТекущийИндекс >= 0 Цикл
		СтрокиНоменклатура.Удалить(СтрокиНоменклатураКУдалению[ТекущийИндекс]);
		ТекущийИндекс = ТекущийИндекс - 1;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоКопия, "ОстаткиПоПредзаказамКопия");	
	
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаСервере
Процедура ОтменитьОтбор()
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	
	ДеревоИсточник = РеквизитФормыВЗначение("ОстаткиПоПредзаказам");
	ДеревоКопия = РеквизитФормыВЗначение("ОстаткиПоПредзаказамКопия");
	
	Для Каждого ТекСтрНоменклатураКопия Из ДеревоКопия.Строки Цикл
		
		Для Каждого ТекСтрЗаказКопия Из ТекСтрНоменклатураКопия.Строки Цикл

			СтрокаНоменклатураИсточник = ДеревоИсточник.Строки[ТекСтрЗаказКопия.ИндексРодитель];
			
			СтрокаЗаказИсточник = СтрокаНоменклатураИсточник.Строки[ТекСтрЗаказКопия.Индекс];
			
			СтрокаЗаказИсточник.Выбрано = ТекСтрЗаказКопия.Выбрано;
			СтрокаЗаказИсточник.Выб = ТекСтрЗаказКопия.Выб;
			СтрокаЗаказИсточник.Цена = ТекСтрЗаказКопия.Цена;
			
		КонецЦикла;
			
	КонецЦикла;

	ЗначениеВРеквизитФормы(ДеревоИсточник, "ОстаткиПоПредзаказам");	
	
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтбора()
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	
	ЭтоПрименитьОтбор = Элементы.ПрименитьОтбор.Заголовок = "Применить отбор";
	
	Элементы.СтрокаПоискаНоменклатура.Доступность = НЕ ЭтоПрименитьОтбор;
	Элементы.МенеджерПредзаказ.Доступность = НЕ ЭтоПрименитьОтбор;
	
	Элементы.ОстаткиПоПредзаказам.Видимость = НЕ ЭтоПрименитьОтбор;
	Элементы.ОстаткиПоПредзаказамКопия.Видимость = ЭтоПрименитьОтбор;
		
	Если ЭтоПрименитьОтбор Тогда
		Элементы.ПрименитьОтбор.Заголовок = "Отменить отбор";
	Иначе
		Элементы.ПрименитьОтбор.Заголовок = "Применить отбор";
	КонецЕсли;	
	
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоПредзаказамКопияВыбратьПриИзменении(Элемент)
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам

	Стр = Элементы.ОстаткиПоПредзаказамКопия.ТекущиеДанные;

	Если Стр.Выбрано > Стр.ВсегоДоступно Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Доступно для выбора: " + Стр.ВсегоДоступно, , "ОстаткиПоПредзаказам[" + 
														   Формат(Стр.ПолучитьИдентификатор(),"ЧГ=")+"]." + Элемент.Имя,);
		Возврат;
		
	КонецЕсли;	
	
	Стр.Выб = Стр.Выбрано > 0;
	
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНоменклатураПриИзменении(Элемент)
//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
	
	Если ЗначениеЗаполнено(СтрокаПоискаНоменклатура) И Элементы.ПрименитьОтбор.Заголовок = "Применить отбор" Тогда
		УстановитьОтбор(Неопределено);
	КонецЕсли;	
	
//--#1227 смарт: Лопато 31.10.2022
КонецПроцедуры

#КонецОбласти
